In [1]:
import pandas as pd

pd.set_option('mode.chained_assignment', None)

In [2]:
from sqlalchemy import create_engine
import pymysql

sqlEngine  = create_engine('mysql+pymysql://root:pass123@127.0.0.1', pool_recycle=3600)
df = pd.read_sql("select * from peg.customerpayments", sqlEngine.connect());

cols = ['Customer Id', 'Contract Id', 'Name', 'Product Type', 'Country', 'Contract Status', 'Sum Paid To Date', 'Expected Total Amount', 'Date']

df = df.set_axis(cols, axis='columns', inplace=False)

df.head()

,Customer Id,Contract Id,Name,Product Type,Country,Contract Status,Sum Paid To Date,Expected Total Amount,Date
0,52,31,D30,Standard,GH,ACTIVE,89100,101400,1/2/2019
1,52,31,D30,Standard,GH,ACTIVE,89100,101600,1/3/2019
2,52,31,D30,Standard,GH,ACTIVE,89100,103000,1/10/2019
3,52,31,D30,Standard,GH,ACTIVE,91100,103800,1/14/2019
4,52,31,D30,Standard,GH,ACTIVE,91100,104000,1/15/2019

In [3]:
df.shape

(4113, 9)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4113 entries, 0 to 4112
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Customer Id            4113 non-null   int64
 1   Contract Id            4113 non-null   int64
 2   Name                   4113 non-null   object
 3   Product Type           4113 non-null   object
 4   Country                4113 non-null   object
 5   Contract Status        4113 non-null   object
 6   Sum Paid To Date       4113 non-null   int64
 7   Expected Total Amount  4113 non-null   int64
 8   Date                   4113 non-null   object
dtypes: int64(4), object(5)
memory usage: 289.3+ KB

In [5]:
# Convert Date column from string to datetime data type
import datetime

df['Date'] = pd.to_datetime(df['Date'])
df.head()

,Customer Id,Contract Id,Name,Product Type,Country,Contract Status,Sum Paid To Date,Expected Total Amount,Date
0,52,31,D30,Standard,GH,ACTIVE,89100,101400,2019-01-02
1,52,31,D30,Standard,GH,ACTIVE,89100,101600,2019-01-03
2,52,31,D30,Standard,GH,ACTIVE,89100,103000,2019-01-10
3,52,31,D30,Standard,GH,ACTIVE,91100,103800,2019-01-14
4,52,31,D30,Standard,GH,ACTIVE,91100,104000,2019-01-15

In [6]:
# Filter last day of months
filtered_month_ends = df.loc[df['Date'].dt.is_month_end]
filtered_month_ends.head()

,Customer Id,Contract Id,Name,Product Type,Country,Contract Status,Sum Paid To Date,Expected Total Amount,Date
24,52,31,D30,Standard,GH,ACTIVE,95100,112800,2019-02-28
97,52,31,D30,Standard,GH,ACTIVE,111100,132800,2019-07-31
113,52,31,D30,Standard,GH,ACTIVE,113100,132800,2019-08-31
146,52,31,D30,Standard,GH,ACTIVE,123100,132800,2019-10-31
160,52,31,D30,Standard,GH,ACTIVE,123100,132800,2019-11-30

In [7]:
filtered_month_ends.shape

(124, 9)

In [8]:
# Extract Month and Year
filtered_month_ends['Month'] = df['Date'].dt.month_name()
filtered_month_ends['Year'] = df['Date'].dt.year

filtered_month_ends.head()

,Customer Id,Contract Id,Name,Product Type,Country,Contract Status,Sum Paid To Date,Expected Total Amount,Date,Month,Year
24,52,31,D30,Standard,GH,ACTIVE,95100,112800,2019-02-28,February,2019
97,52,31,D30,Standard,GH,ACTIVE,111100,132800,2019-07-31,July,2019
113,52,31,D30,Standard,GH,ACTIVE,113100,132800,2019-08-31,August,2019
146,52,31,D30,Standard,GH,ACTIVE,123100,132800,2019-10-31,October,2019
160,52,31,D30,Standard,GH,ACTIVE,123100,132800,2019-11-30,November,2019

In [9]:
# Sort Months
months = ['January', 'February', 'March', 'April','May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']
filtered_month_ends['Month'] = pd.Categorical(filtered_month_ends['Month'],categories=months, ordered=True)

filtered_month_ends.sort_values(['Month'], inplace=True)
filtered_month_ends.head()

,Customer Id,Contract Id,Name,Product Type,Country,Contract Status,Sum Paid To Date,Expected Total Amount,Date,Month,Year
956,29,7,Unknown,Unknown,CDI,PAID_OFF,140000,120500,2019-01-31,January,2019
574,27,5,Unknown,Unknown,FR,PAID_OFF,140000,120500,2019-01-31,January,2019
1147,30,8,Unknown,Unknown,CDI,PAID_OFF,123400,118200,2019-01-31,January,2019
192,25,3,Unknown,Unknown,FR,PAID_OFF,140370,120500,2019-01-31,January,2019
1338,31,9,Unknown,Unknown,CDI,PAID_OFF,81500,118000,2019-01-31,January,2019

In [10]:
# Calculate RE
filtered_month_ends['RE'] = (filtered_month_ends['Sum Paid To Date'] / filtered_month_ends['Expected Total Amount'])
filtered_month_ends.head()

,Customer Id,Contract Id,Name,Product Type,Country,Contract Status,Sum Paid To Date,Expected Total Amount,Date,Month,Year,RE
956,29,7,Unknown,Unknown,CDI,PAID_OFF,140000,120500,2019-01-31,January,2019,1.161826
574,27,5,Unknown,Unknown,FR,PAID_OFF,140000,120500,2019-01-31,January,2019,1.161826
1147,30,8,Unknown,Unknown,CDI,PAID_OFF,123400,118200,2019-01-31,January,2019,1.043993
192,25,3,Unknown,Unknown,FR,PAID_OFF,140370,120500,2019-01-31,January,2019,1.164896
1338,31,9,Unknown,Unknown,CDI,PAID_OFF,81500,118000,2019-01-31,January,2019,0.690678

In [11]:
filtered_month_ends.RE.describe()

count    124.000000
mean       0.952194
std        0.271252
min        0.266272
25%        0.836596
50%        1.073529
75%        1.161826
max        1.165104
Name: RE, dtype: float64

In [12]:
aggregated_RE = filtered_month_ends.groupby(['Month', 'Country', 'Product Type']).agg({'RE': 'mean'}).reset_index()
aggregated_RE.head()

     Month Country Product Type        RE
0  January     CDI     Standard       NaN
1  January     CDI      Unknown  1.014581
2  January      FR     Standard       NaN
3  January      FR      Unknown  0.983063
4  January      GH     Standard       NaN

In [13]:
# Replace NaN with 0
aggregated_RE['RE'] = aggregated_RE['RE'].fillna(0)

In [14]:
# Save to Excel
aggregated_RE.to_excel(r'PEG Customer Payments.xlsx', sheet_name='Customer RE', index=False)
print("Data saved to Excel")

Data saved to Excel

In [15]:
# RE by Month and Product Name
month_product_RE = filtered_month_ends.groupby(['Month', 'Name']).agg({'RE': 'mean'}).reset_index()
month_product_RE

        Month     Name        RE
0     January      D30       NaN
1     January  Unknown  1.017274
2    February      D30  0.843085
3    February  Unknown  0.869987
4       March      D30       NaN
5       March  Unknown  1.015582
6       April      D30       NaN
7       April  Unknown  1.012629
8         May      D30       NaN
9         May  Unknown  1.009077
10       June      D30       NaN
11       June  Unknown  1.052208
12       July      D30  0.836596
13       July  Unknown  0.884329
14     August      D30  0.851657
15     August  Unknown  0.892402
16  September      D30       NaN
17  September  Unknown  1.071803
18    October      D30  0.926958
19    October  Unknown  0.903285
20   November      D30  0.926958
21   November  Unknown  0.917663
22   December      D30       NaN
23   December  Unknown       NaN

In [16]:
# RE by Month and Status
month_status_RE = filtered_month_ends.groupby(['Month', 'Contract Status']).agg({'RE': 'mean'}).reset_index()
month_status_RE

        Month Contract Status        RE
0     January          ACTIVE  0.802764
1     January        PAID_OFF  1.078563
2    February          ACTIVE  0.646951
3    February        PAID_OFF  1.162884
4       March          ACTIVE  0.790012
5       March        PAID_OFF  1.080030
6       April          ACTIVE  0.792443
7       April        PAID_OFF  1.075539
8         May          ACTIVE  0.756373
9         May        PAID_OFF  1.081278
10       June          ACTIVE  0.753773
11       June        PAID_OFF  1.137476
12       July          ACTIVE  0.669446
13       July        PAID_OFF  1.162884
14     August          ACTIVE  0.684448
15     August        PAID_OFF  1.162884
16  September          ACTIVE  0.841950
17  September        PAID_OFF  1.137476
18    October          ACTIVE  0.711545
19    October        PAID_OFF  1.162884
20   November          ACTIVE  0.734910
21   November        PAID_OFF  1.162884
22   December          ACTIVE       NaN
23   December        PAID_OFF       NaN